import { createStore } from "vuex";


const productListSlice = createStore({
    state() {
        return {
            items: [
                {
                    "id": 109,
                    "idGroup": 4,
                    "product": {
                        "id": 3,
                        "name": "Шампунь Чистая линия",
                        "price": 32000,
                        "description": "Сделает ваши волосы неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми",
                        "weight": 1,
                        "unitType": "л.",
                    }
                },
                {
                    "id": 100,
                    "idGroup": 3,
                    "product": {
                        "id": 1,
                        "name": "Утюг",
                        "price": 190000
                    }
                },
                {
                    "id": 101,
                    "idGroup": null,
                    "product": {
                        "id": 1,
                        "description": "Сделает ваши волосы неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми",
                        "name": "Прочий товар, без каталога",
                        "price": 14600
                    }
                },
                                {
                    "id": 109,
                    "idGroup": 4,
                    "product": {
                        "id": 3,
                        "name": "Шампунь Чистая линия",
                        "price": 32000,
                        "description": "Сделает ваши волосы неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми",
                        "weight": 1,
                        "unitType": "л.",
                    }
                },
                {
                    "id": 100,
                    "idGroup": 3,
                    "product": {
                        "id": 1,
                        "name": "Утюг",
                        "price": 190000
                    }
                },
                {
                    "id": 101,
                    "idGroup": null,
                    "product": {
                        "id": 1,
                        "description": "Сделает ваши волосы неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми",
                        "name": "Прочий товар, без каталога",
                        "price": 14600
                    }
                },
                                {
                    "id": 109,
                    "idGroup": 4,
                    "product": {
                        "id": 3,
                        "name": "Шампунь Чистая линия",
                        "price": 32000,
                        "description": "Сделает ваши волосы неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми",
                        "weight": 1,
                        "unitType": "л.",
                    }
                },
                {
                    "id": 100,
                    "idGroup": 3,
                    "product": {
                        "id": 1,
                        "name": "Утюг",
                        "price": 190000
                    }
                },
                {
                    "id": 101,
                    "idGroup": null,
                    "product": {
                        "id": 1,
                        "description": "Сделает ваши волосы неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми",
                        "name": "Прочий товар, без каталога",
                        "price": 14600
                    }
                },
                                {
                    "id": 109,
                    "idGroup": 4,
                    "product": {
                        "id": 3,
                        "name": "Шампунь Чистая линия",
                        "price": 32000,
                        "description": "Сделает ваши волосы неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми",
                        "weight": 1,
                        "unitType": "л.",
                    }
                },
                {
                    "id": 100,
                    "idGroup": 3,
                    "product": {
                        "id": 1,
                        "name": "Утюг",
                        "price": 190000
                    }
                },
                {
                    "id": 101,
                    "idGroup": null,
                    "product": {
                        "id": 1,
                        "description": "Сделает ваши волосы неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми",
                        "name": "Прочий товар, без каталога",
                        "price": 14600
                    }
                },
                                {
                    "id": 109,
                    "idGroup": 4,
                    "product": {
                        "id": 3,
                        "name": "Шампунь Чистая линия",
                        "price": 32000,
                        "description": "Сделает ваши волосы неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми",
                        "weight": 1,
                        "unitType": "л.",
                    }
                },
                {
                    "id": 100,
                    "idGroup": 3,
                    "product": {
                        "id": 1,
                        "name": "Утюг",
                        "price": 190000
                    }
                },
                {
                    "id": 101,
                    "idGroup": null,
                    "product": {
                        "id": 1,
                        "description": "Сделает ваши волосы неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми неотразимыми",
                        "name": "Прочий товар, без каталога",
                        "price": 14600
                    }
                },

            ],
        }
    },
});


export default productListSlice;